БИТУправление_медицинским_центром_демо/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПолучателяЗатрат</name>
    <type>
      <types>EnumRef.ВариантыПолучателяПоступившихЗатрат</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (материал или услуга)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияВыработки</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПолучатель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ПартииТоваровНаСкладах/ПартииТоваровНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииТоваровНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОприходования</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ОказаниеУслуг</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.РеестрОказанныхУслугПоСоглашениям</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КатегорияВыработки</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура затраты (т.е. не получатель затраты, а, например, полученная услуга от поставщика)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПолучатель</name>
    <comment>Номенклатура-получатель затраты</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВариантыПолучателяПоступившихЗатрат/ВариантыПолучателяПоступившихЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПолучателяПоступившихЗатрат</name>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураЗатраты</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыСкладов/ТипыСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСкладов</name>
  <enumValues>
    <name>Аптека</name>
  </enumValues>
  <enumValues>
    <name>Отделение</name>
  </enumValues>
  <enumValues>
    <name>РозничныйМагазин</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/СостоянияПодтвержденияМДЛП/СостоянияПодтвержденияМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПодтвержденияМДЛП</name>
  <enumValues>
    <name>КПередаче</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленоКПередаче</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>Подтвердить</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьПодготовленоКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьПередано</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьПринятоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>Подтверждено</name>
  </enumValues>
  <enumValues>
    <name>Отозвать</name>
  </enumValues>
  <enumValues>
    <name>ОтозватьПодготовленоКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ОтозватьПередано</name>
  </enumValues>
  <enumValues>
    <name>ОтозваноПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ОтозватьОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>Отказаться</name>
  </enumValues>
  <enumValues>
    <name>ОтказатьсяПодготовленоКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ОтказатьсяПередано</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоПокупателем</name>
  </enumValues>
  <enumValues>
    <name>ОтказатьсяОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>АктуализироватьДанныеОбУпаковках</name>
  </enumValues>
  <enumValues>
    <name>ДанныеОбУпаковкахАктуализированы</name>
  </enumValues>
  <enumValues>
    <name>ОприходованоНовымВладельцем</name>
  </enumValues>
  <enumValues>
    <name>ВвезеноВРФБезПодтверждения</name>
  </enumValues>
  <enumValues>
    <name>ПереданоЧастично</name>
  </enumValues>
  <enumValues>
    <name>ПринятоЧастично</name>
  </enumValues>
  <enumValues>
    <name>ПринятоСОтклонениемОтТребований</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>ОформитьУведомления</name>
  </enumValues>
  <enumValues>
    <name>ОформитьИнвентаризацию</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыСтавокНДС/ВидыСтавокНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтавокНДС</name>
  <enumValues>
    <name>Общая</name>
  </enumValues>
  <enumValues>
    <name>ОбщаяРасчетная</name>
  </enumValues>
  <enumValues>
    <name>Пониженная</name>
  </enumValues>
  <enumValues>
    <name>ПониженнаяРасчетная</name>
  </enumValues>
  <enumValues>
    <name>Нулевая</name>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЕдиницы</name>
    <type>
      <types>EnumRef.ТипыЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЛекарственныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостоитИзДругихУпаковок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВПотребительскойУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВложеннаяУпаковка</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Documents/ПоступлениеТоваровУслуг/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ВариантПолучателяЗатрат = Перечисления.ВариантыПолучателяПоступившихЗатрат.НоменклатураЗатраты Тогда
		Для Каждого СтрокаУслуги Из Услуги Цикл 
			Если ЗначениеЗаполнено(СтрокаУслуги.НоменклатураПолучатель) Тогда 
				СтрокаУслуги.НоменклатураПолучатель = Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ИнтеграцияМДЛПВызовСервера_БИТ.ВедетсяУчетМДЛП()
			И Склад.ТипСклада = Перечисления.ТипыСкладов.Отделение
		Тогда
			Для Каждого СтрокаТоваров Из Товары Цикл
				Если СтрокаТоваров.СерияНоменклатуры.СерияПромаркированаДляЦелейМДЛП Тогда
					Отказ = Истина;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нельзя оформлять поступления серий маркированных лекарств на склад отделения!'"));
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Перем ТаблицаПоТоварам;
	
	ПроведениеДокументов.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = НСтр("ru='Проведение документа'");
	Заголовок = Заголовок + " """ + СокрЛП(Ссылка) + """: ";
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	СтруктураОбязательныхПолей = Новый Структура;
	Если Товары.Количество() > 0 Тогда
		СтруктураОбязательныхПолей.Вставить("Склад");
	КонецЕсли;
	ПроведениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ПроверитьЗаполнениеТабличнойЧастиТовары(Товары.Выгрузить(), СтруктураШапкиДокумента, Отказ, Заголовок, "Товары");	
	
	СтруктураОбязательныхПолей = Новый Структура();
	СтруктураОбязательныхПолей.Вставить("СтатьяЗатрат");
	СтруктураОбязательныхПолей.Вставить("Сумма");
	ПроведениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		
		// Движения по регистру ПартииТоваровНаСкладах
		ПроведениеДокументов.ПодготовитьТаблицуТоварыДокумента(ЭтотОбъект, ТаблицаПоТоварам);
		ПартионныйУчет.пуОприходованиеПартийТоваров(СтруктураШапкиДокумента, ТаблицаПоТоварам, Движения.ПартииТоваровНаСкладах);
		
		// Движения по регистру ВзаиморасчетыСКонтрагентами
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Сумма = СуммаДокумента;
		
		// Движения по регистру затрат
		Для Каждого ТекСтрокаУслуги Из Услуги Цикл
			
			Движение = Движения.Затраты.Добавить();
			Движение.Регистратор  = Ссылка;
			Движение.Период		  = Дата;
			ЗаполнитьЗначенияСвойств(Движение,ТекСтрокаУслуги,,"НомерСтроки");
			
			Если ВариантПолучателяЗатрат = Перечисления.ВариантыПолучателяПоступившихЗатрат.НоменклатураЗатраты Тогда 
				Движение.НоменклатураПолучатель = ТекСтрокаУслуги.Номенклатура; 	
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.УведомлениеОПриемкеМДЛП") Тогда
		ЗаполнитьДокументНаОснованииУведомленияОПриемке(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.УведомлениеОбОприходованииМДЛП") Тогда
		ЗаполнитьДокументНаОснованииУведомленияОбОприходовании(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок, ИмяТабличнойЧасти = "Товары")

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Сумма");
	                                                        
	// Общая процедура проверки.
	ПроведениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Здесь услуг быть не должно.
	РаботаСДокументамиСервер.ПроверитьЧтоНетУслуг(ЭтотОбъект, ИмяТабличнойЧасти, ТаблицаПоТоварам, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

#Область МДЛП

Процедура ЗаполнитьДокументНаОснованииУведомленияОПриемке(ДокументОснование)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеДокумента.Ссылка КАК Основание,
	                      |	ДанныеДокумента.Организация КАК ОрганизацияМДЛП,
	                      |	ДанныеДокумента.МестоДеятельности КАК МестоДеятельности,
	                      |	ДанныеДокумента.Грузоотправитель КАК КонтрагентМДЛП,
	                      |	ДанныеДокумента.МестоДеятельностиГрузоотправителя КАК МестоДеятельностиКонтрагента,
	                      |	ДанныеДокумента.НомерДокумента КАК НомерВходящегоДокумента,
	                      |	ДанныеДокумента.ДатаДокумента КАК ДатаВходящегоДокумента,
	                      |	ИСТИНА КАК ЦенаВключаетНДС,
	                      |	НЕ ДанныеДокумента.Проведен КАК ЕстьОшибкиПроведен
	                      |ИЗ
	                      |	Документ.УведомлениеОПриемкеМДЛП КАК ДанныеДокумента
	                      |ГДЕ
	                      |	ДанныеДокумента.Ссылка = &ДокументОснование
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	УпаковкиТовара.ИдентификаторСтроки КАК ИдентификаторСтроки,
	                      |	КОЛИЧЕСТВО(1) КАК Количество
	                      |ПОМЕСТИТЬ ПринятыеУпаковкиТовара
	                      |ИЗ
	                      |	Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК УпаковкиТовара
	                      |ГДЕ
	                      |	УпаковкиТовара.Ссылка = &ДокументОснование
	                      |	И НЕ УпаковкиТовара.СостояниеПодтверждения В (ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком), ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем), ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.НеТребуется))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	УпаковкиТовара.ИдентификаторСтроки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	                      |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	                      |	ТаблицаТовары.Серия КАК СерияНоменклатуры,
	                      |	ПринятыеУпаковкиТовара.Количество КАК КоличествоВЕдиницахИзмерения,
	                      |	ТаблицаТовары.Количество КАК КоличествоУпаковокПоДокументу,
	                      |	ТаблицаТовары.Номенклатура.Упаковка КАК ЕдиницаИзмерения,
	                      |	ЕдиницыИзмерения.Коэффициент КАК Коэффициент,
	                      |	ТаблицаТовары.Количество КАК Количество,
	                      |	ТаблицаТовары.Цена КАК Цена,
	                      |	ТаблицаТовары.Сумма КАК Сумма,
	                      |	ВЫБОР
	                      |		КОГДА ТаблицаТовары.СуммаНДС = 0
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	                      |		ИНАЧЕ ТаблицаТовары.Номенклатура.ВидСтавкиНДС
	                      |	КОНЕЦ КАК ВидСтавкиНДС,
	                      |	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	                      |	ТаблицаТовары.Сумма КАК СуммаСНДС,
	                      |	ЕдиницыИзмерения.СостоитИзДругихУпаковок КАК СостоитИзДругихУпаковок,
	                      |	ЕдиницыИзмерения.Коэффициент КАК ЕмкостьУпаковки,
	                      |	ЕдиницыИзмерения.КоличествоВУпаковке КАК КоличествоВУпаковке,
	                      |	ЕдиницыИзмерения.ВложеннаяУпаковка КАК ВложеннаяУпаковка,
	                      |	ЕдиницыИзмерения.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения
	                      |ИЗ
	                      |	Документ.УведомлениеОПриемкеМДЛП.Товары КАК ТаблицаТовары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	                      |		ПО ТаблицаТовары.Номенклатура.Упаковка = ЕдиницыИзмерения.Ссылка
	                      |			И ТаблицаТовары.Номенклатура = ЕдиницыИзмерения.Владелец
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПринятыеУпаковкиТовара КАК ПринятыеУпаковкиТовара
	                      |		ПО ТаблицаТовары.ИдентификаторСтроки = ПринятыеУпаковкиТовара.ИдентификаторСтроки
	                      |ГДЕ
	                      |	ТаблицаТовары.Ссылка = &ДокументОснование
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТаблицаТовары.ИдентификаторСтроки,
	                      |	ТаблицаТовары.Номенклатура,
	                      |	ТаблицаТовары.Серия,
	                      |	ТаблицаТовары.Количество,
	                      |	ТаблицаТовары.Количество,
	                      |	ТаблицаТовары.Номенклатура.Упаковка,
	                      |	ЕдиницыИзмерения.Коэффициент,
	                      |	ТаблицаТовары.Количество,
	                      |	ТаблицаТовары.Цена,
	                      |	ТаблицаТовары.Сумма,
	                      |	ВЫБОР
	                      |		КОГДА ТаблицаТовары.СуммаНДС = 0
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	                      |		ИНАЧЕ ТаблицаТовары.Номенклатура.ВидСтавкиНДС
	                      |	КОНЕЦ,
	                      |	ТаблицаТовары.СуммаНДС * ТаблицаТовары.Количество,
	                      |	ТаблицаТовары.Сумма,
	                      |	ЕдиницыИзмерения.СостоитИзДругихУпаковок,
	                      |	ЕдиницыИзмерения.Коэффициент,
	                      |	ЕдиницыИзмерения.КоличествоВУпаковке,
	                      |	ЕдиницыИзмерения.ВложеннаяУпаковка,
	                      |	ЕдиницыИзмерения.БазоваяЕдиницаИзмерения
	                      |ИЗ
	                      |	Документ.УведомлениеОПриемкеМДЛП.СоставТранспортныхУпаковок КАК ТаблицаТовары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	                      |		ПО ТаблицаТовары.Номенклатура.Упаковка = ЕдиницыИзмерения.Ссылка
	                      |			И ТаблицаТовары.Номенклатура = ЕдиницыИзмерения.Владелец
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК ПринятыеУпаковкиТовара
	                      |		ПО ТаблицаТовары.Ссылка = ПринятыеУпаковкиТовара.Ссылка
	                      |			И ТаблицаТовары.ИдентификаторСтроки = ПринятыеУпаковкиТовара.ИдентификаторСтроки
	                      |			И (НЕ ПринятыеУпаковкиТовара.СостояниеПодтверждения В (ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком), ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем), ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.НеТребуется)))
	                      |ГДЕ
	                      |	ТаблицаТовары.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	РеквизитыШапки = РезультатЗапроса[0].Выбрать();
	РеквизитыШапки.Следующий();
	
	ОбщегоНазначенияМедицина.ПроверитьВозможностьВводаНаОсновании(РеквизитыШапки.Основание, РеквизитыШапки.ЕстьОшибкиПроведен);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыШапки);
	
	Субъект = ИнтеграцияМДЛПМедицина_БИТ.ОбъектПоОрганизацииМестуДеятельности(РеквизитыШапки.ОрганизацияМДЛП, РеквизитыШапки.МестоДеятельности, Истина);
	Филиал		= Субъект.Организация;
	Склад		= Субъект.Склад;
	
	// Учет в разрезе мест деятельности контрагентов не ведется, значит определяем только по контрагентуМДЛП
	Субъект	= ИнтеграцияМДЛПМедицина_БИТ.ОбъектПоОрганизацииМестуДеятельности(РеквизитыШапки.КонтрагентМДЛП, , Ложь);
	Контрагент	= Субъект.Организация;
	
	ВыборкаТовары = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		
		СтрокаТовара = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовара, ВыборкаТовары);
		
		// Считаем, что стандартным интерфейсом пользователь не способен сделать Упаковку, ссылающуюся на неактуальную ЕХО данной Номенклатуры
		ЕХО = СтрокаТовара.Номенклатура.ЕдиницаХраненияОстатков;
		КоэффициентЕХО = ЕХО.Коэффициент;
		КоэфициентУпаковки = ПолучитьКоэффициентУпаковки(ВыборкаТовары.ЕдиницаИзмерения);		
		
		СтрокаТовара.ЕдиницаИзмерения	= ЕХО;
		СтрокаТовара.Коэффициент	= КоэффициентЕХО;
		СтрокаТовара.Количество		= СтрокаТовара.Количество * КоэфициентУпаковки;
		СтрокаТовара.Цена			= ?(СтрокаТовара.Количество = 0, СтрокаТовара.Цена, СтрокаТовара.Сумма / СтрокаТовара.Количество);
	КонецЦикла;
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииУведомленияОбОприходовании(ДокументОснование)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДанныеДокумента.Ссылка КАК Основание,
	                      |	ДанныеДокумента.Организация КАК ОрганизацияМДЛП,
	                      |	ДанныеДокумента.МестоДеятельности КАК МестоДеятельности,
	                      |	ДанныеДокумента.Грузоотправитель КАК КонтрагентМДЛП,
	                      |	ДанныеДокумента.МестоДеятельностиГрузоотправителя КАК МестоДеятельностиКонтрагента,
	                      |	ДанныеДокумента.НомерДокумента КАК НомерВходящегоДокумента,
	                      |	ДанныеДокумента.ДатаДокумента КАК ДатаВходящегоДокумента,
	                      |	ИСТИНА КАК ЦенаВключаетНДС,
	                      |	НЕ ДанныеДокумента.Проведен КАК ЕстьОшибкиПроведен
	                      |ИЗ
	                      |	Документ.УведомлениеОбОприходованииМДЛП КАК ДанныеДокумента
	                      |ГДЕ
	                      |	ДанныеДокумента.Ссылка = &ДокументОснование
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	УпаковкиТовара.ИдентификаторСтроки КАК ИдентификаторСтроки,
	                      |	КОЛИЧЕСТВО(1) КАК Количество
	                      |ПОМЕСТИТЬ ПринятыеУпаковкиТовара
	                      |ИЗ
	                      |	Документ.УведомлениеОбОприходованииМДЛП.НомераУпаковок КАК УпаковкиТовара
	                      |ГДЕ
	                      |	УпаковкиТовара.Ссылка = &ДокументОснование
	                      |	И НЕ УпаковкиТовара.СостояниеПолученияИнформации В (ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком), ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем), ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.НеТребуется))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	УпаковкиТовара.ИдентификаторСтроки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	                      |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	                      |	ТаблицаТовары.Серия КАК СерияНоменклатуры,
	                      |	ПринятыеУпаковкиТовара.Количество КАК КоличествоВЕдиницахИзмерения,
	                      |	ТаблицаТовары.Количество КАК КоличествоУпаковокПоДокументу,
	                      |	ТаблицаТовары.Номенклатура.Упаковка КАК ЕдиницаИзмерения,
	                      |	ЕдиницыИзмерения.Коэффициент КАК Коэффициент,
	                      |	ТаблицаТовары.Количество КАК Количество,
	                      |	ТаблицаТовары.Цена КАК Цена,
	                      |	ТаблицаТовары.Сумма КАК Сумма,
	                      |	ВЫБОР
	                      |		КОГДА ТаблицаТовары.СуммаНДС = 0
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	                      |		ИНАЧЕ ТаблицаТовары.Номенклатура.ВидСтавкиНДС
	                      |	КОНЕЦ КАК ВидСтавкиНДС,
	                      |	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	                      |	ТаблицаТовары.Сумма КАК СуммаСНДС,
	                      |	ЕдиницыИзмерения.СостоитИзДругихУпаковок КАК СостоитИзДругихУпаковок,
	                      |	ЕдиницыИзмерения.Коэффициент КАК ЕмкостьУпаковки,
	                      |	ЕдиницыИзмерения.КоличествоВУпаковке КАК КоличествоВУпаковке,
	                      |	ЕдиницыИзмерения.ВложеннаяУпаковка КАК ВложеннаяУпаковка,
	                      |	ЕдиницыИзмерения.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения
	                      |ИЗ
	                      |	Документ.УведомлениеОбОприходованииМДЛП.Товары КАК ТаблицаТовары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	                      |		ПО ТаблицаТовары.Номенклатура.Упаковка = ЕдиницыИзмерения.Ссылка
	                      |			И ТаблицаТовары.Номенклатура = ЕдиницыИзмерения.Владелец
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПринятыеУпаковкиТовара КАК ПринятыеУпаковкиТовара
	                      |		ПО ТаблицаТовары.ИдентификаторСтроки = ПринятыеУпаковкиТовара.ИдентификаторСтроки
	                      |ГДЕ
	                      |	ТаблицаТовары.Ссылка = &ДокументОснование
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТаблицаТовары.ИдентификаторСтроки,
	                      |	ТаблицаТовары.Номенклатура,
	                      |	ТаблицаТовары.Серия,
	                      |	ТаблицаТовары.Количество,
	                      |	ТаблицаТовары.Количество,
	                      |	ТаблицаТовары.Номенклатура.Упаковка,
	                      |	ЕдиницыИзмерения.Коэффициент,
	                      |	ТаблицаТовары.Количество,
	                      |	ТаблицаТовары.Цена,
	                      |	ТаблицаТовары.Сумма,
	                      |	ВЫБОР
	                      |		КОГДА ТаблицаТовары.СуммаНДС = 0
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	                      |		ИНАЧЕ ТаблицаТовары.Номенклатура.ВидСтавкиНДС
	                      |	КОНЕЦ,
	                      |	ТаблицаТовары.СуммаНДС * ТаблицаТовары.Количество,
	                      |	ТаблицаТовары.Сумма,
	                      |	ЕдиницыИзмерения.СостоитИзДругихУпаковок,
	                      |	ЕдиницыИзмерения.Коэффициент,
	                      |	ЕдиницыИзмерения.КоличествоВУпаковке,
	                      |	ЕдиницыИзмерения.ВложеннаяУпаковка,
	                      |	ЕдиницыИзмерения.БазоваяЕдиницаИзмерения
	                      |ИЗ
	                      |	Документ.УведомлениеОбОприходованииМДЛП.СоставТранспортныхУпаковок КАК ТаблицаТовары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	                      |		ПО ТаблицаТовары.Номенклатура.Упаковка = ЕдиницыИзмерения.Ссылка
	                      |			И ТаблицаТовары.Номенклатура = ЕдиницыИзмерения.Владелец
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОприходованииМДЛП.ТранспортныеУпаковки КАК ПринятыеУпаковкиТовара
	                      |		ПО ТаблицаТовары.Ссылка = ПринятыеУпаковкиТовара.Ссылка
	                      |			И ТаблицаТовары.ИдентификаторСтроки = ПринятыеУпаковкиТовара.ИдентификаторСтроки
	                      |			И (НЕ ПринятыеУпаковкиТовара.СостояниеПолученияИнформации В (ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтозваноПоставщиком), ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.ОтклоненоПокупателем), ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.НеТребуется)))
	                      |ГДЕ
	                      |	ТаблицаТовары.Ссылка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	РеквизитыШапки = РезультатЗапроса[0].Выбрать();
	РеквизитыШапки.Следующий();
	
	ОбщегоНазначенияМедицина.ПроверитьВозможностьВводаНаОсновании(РеквизитыШапки.Основание, РеквизитыШапки.ЕстьОшибкиПроведен);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыШапки);
	
	Субъект = ИнтеграцияМДЛПМедицина_БИТ.ОбъектПоОрганизацииМестуДеятельности(РеквизитыШапки.ОрганизацияМДЛП, РеквизитыШапки.МестоДеятельности, Истина);
	Филиал		= Субъект.Организация;
	Склад		= Субъект.Склад;
	
	// Учет в разрезе мест деятельности контрагентов не ведется, значит определяем только по контрагентуМДЛП
	Субъект	= ИнтеграцияМДЛПМедицина_БИТ.ОбъектПоОрганизацииМестуДеятельности(РеквизитыШапки.КонтрагентМДЛП, , Ложь);
	Контрагент	= Субъект.Организация;
	
	ВыборкаТовары = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		
		СтрокаТовара = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовара, ВыборкаТовары);
		
		// Считаем, что стандартным интерфейсом пользователь не способен сделать Упаковку, ссылающуюся на неактуальную ЕХО данной Номенклатуры
		ЕХО = СтрокаТовара.Номенклатура.ЕдиницаХраненияОстатков;
		КоэффициентЕХО = ЕХО.Коэффициент;
		КоэфициентУпаковки = ПолучитьКоэффициентУпаковки(ВыборкаТовары.ЕдиницаИзмерения);		
		
		СтрокаТовара.ЕдиницаИзмерения	= ЕХО;
		СтрокаТовара.Коэффициент	= КоэффициентЕХО;
		СтрокаТовара.Количество		= СтрокаТовара.Количество * КоэфициентУпаковки;
		СтрокаТовара.Цена			= ?(СтрокаТовара.Количество = 0, СтрокаТовара.Цена, СтрокаТовара.Сумма / СтрокаТовара.Количество);
	КонецЦикла;
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Функция ПолучитьКоэффициентУпаковки(Упаковка) 
	Если ЗначениеЗаполнено(Упаковка) И Упаковка.СостоитИзДругихУпаковок Тогда
		Возврат Упаковка.КоличествоВУпаковке * ПолучитьКоэффициентУпаковки(Упаковка.ВложеннаяУпаковка);
	Иначе
		Возврат Упаковка.Коэффициент;
	КонецЕсли;
КонецФункции

Функция ПолучитьЕдиницуИзмеренияВложеннойУпаковки(Упаковка) 
	Если ЗначениеЗаполнено(Упаковка) И Упаковка.СостоитИзДругихУпаковок Тогда
		Возврат ПолучитьЕдиницуИзмеренияВложеннойУпаковки(Упаковка.ВложеннаяУпаковка);
	Иначе
		Возврат Упаковка.БазоваяЕдиницаИзмерения;
	КонецЕсли;
КонецФункции

#КонецОбласти // МДЛП

#КонецОбласти
